[
  {
    "id": 1,
    "title": "New Saudi Arabian GrandPrix Track",
    "img": "https://www.the-race.com/content/images/size/w1000/2025/04/hero-speedpark.webp",
    "description": "F1 shows the new renders of the Saudi Arabian GrandPrix Track in Qiddiya",
    "detailed_news": "The Saudi Arabian Grand Prix’s move to the new track in Qiddiya, the entertainment and tourism ‘megaproject’ dubbed “the world’s first city built for play” currently in construction just outside Riyadh, could be pushed back to as late as 2029, with the Jeddah Corniche Circuit continuing to host the race for as long as required.",
    "video_link": "",
    "date_of_upload": "2025-04-15T10:00:00-07:00",
    "channel": "Formula 1"
  },
  {
    "id": 2,
    "title": "Max Verstappen Dismisses Red Bull Exit Fears",
    "img": "https://sportsbase.io/images/gpfans/copy_1200x800/91184c71ab33e294da67b94263e13d847951ec94.png",
    "description": "Red Bull's rocky start sparks panic and speculation over Verstappen's future",
    "detailed_news": "Red Bull Racing's troubled start into the 2025 Formula 1 season has ignited internal crisis talks and led to a reshuffling of their driver lineup. After a disappointing performance at the Bahrain Grand Prix, tensions are rising behind the scenes, and the spotlight is now firmly on Max Verstappen’s long-term future with the team. Verstappen, however, has dismissed any fears of a potential exit from Red Bull, stating that he remains committed to the team and its goals. The Dutch driver emphasized the importance of unity and focus as they work to resolve their early-season struggles.",
    "video_link": "",
    "date_of_upload": "2025-04-16T08:00:00-07:00",
    "channel": "Mercedes-AMG PETRONAS F1 Team"
  },
  {
    "id": 3,
    "title": "Mercedes’ Comeback?",
    "img": "/images/mercedes.jpg",
    "description": "Silver Arrows show pace, but is it real or just a mirage? 🤔",
    "detailed_news": "Mercedes is poised for a strong return in the upcoming season, with new strategies and improved car performance aiming to reclaim their top position in the championship. The Silver Arrows showed impressive pace in recent tests, but questions remain about consistency. Is this a genuine comeback, or just a fleeting mirage? Experts are divided as the team prepares for the next race.",
    "video_link": "",
    "date_of_upload": "2025-04-16T08:00:00-07:00",
    "channel": "Mercedes-AMG PETRONAS F1 Team"
  },
  {
    "id": 4,
    "title": "Adrian Newey to keep 100% focus on 2026 Aston Martin",
    "img": "https://sportsbase.io/images/gpfans/copy_1200x800/75c07cc3095d16e55ce1fa3e71cc23e4f776e90e.png",
    "description": "Adrian Newey, Aston Martin's new managing technical partner, is dedicating his efforts entirely to the 2026 Formula 1 car, aligning with the upcoming regulation changes.",
    "detailed_news": "Adrian Newey, renowned for his engineering prowess in Formula 1, has commenced his role at Aston Martin with a clear focus on the 2026 car, in anticipation of significant regulatory changes. Team principal Andy Cowell confirmed that Newey is fully engaged in designing the 2026 vehicle, emphasizing that his expertise is being channeled into understanding and adapting to the new rules. While the primary attention is on the future car, Cowell mentioned that Newey might contribute to the 2025 model as the season progresses. This strategic move underscores Aston Martin's commitment to becoming a formidable contender in the new era of Formula 1.",
    "video_link": "",
    "date_of_upload": "2025-04-16T08:00:00-07:00",
    "channel": "Mercedes-AMG PETRONAS F1 Team"
  },
  {
    "id": 5,
    "title": "Hülkenberg Disqualified After Post-Race Plank Violation",
    "img": "https://i2-prod.mirror.co.uk/article35048832.ece/ALTERNATES/s615/0_F1-Grand-Prix-of-Bahrain-Qualifying.jpg",
    "description": "Nico Hülkenberg’s Bahrain Grand Prix result is nullified after post-race checks reveal excessive plank wear.",
    "detailed_news": "Sauber driver Nico Hülkenberg was disqualified from the 2025 Bahrain Grand Prix after scrutineering revealed his car's plank exceeded wear limits. The German had initially finished P11, just outside the points. The team stated that the setup miscalculation on ride height contributed to the issue and will reevaluate ahead of the next round.",
    "video_link": "",
    "date_of_upload": "2025-04-16T18:00:00-07:00",
    "channel": "Haas F1 Team"
  },
  {
    "id": 6,
    "title": "Red Bull's Bahrain Blues: Verstappen Frustrated After P6",
    "img": "https://images.ps-aws.com/c?url=https%3A%2F%2Fd3cm515ijfiu6w.cloudfront.net%2Fwp-content%2Fuploads%2F2023%2F07%2F20142724%2Fmax-verstappen-red-bull-hungarian-grand-prix-planet-f1-2023.jpg",
    "description": "Max Verstappen struggles to sixth place after pit stop issues and tire strategy woes in Bahrain.",
    "detailed_news": "Red Bull endured a forgettable weekend in Bahrain, with Max Verstappen finishing only sixth after two slow pit stops and a suboptimal tire strategy. The defending champion voiced frustration over team decisions, but remained optimistic about future improvements. Senior figures at Red Bull are reportedly concerned about performance stagnation heading into a crucial season.",
    "video_link": "",
    "date_of_upload": "2025-04-16T17:30:00-07:00",
    "channel": "Red Bull Racing"
  },
  {
    "id": 7,
    "title": "Lando Norris Takes Championship Lead Despite Penalty",
    "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTQse7SSq13fwQ9YRjF3hjvfjcC_D2APwdI5Q&s",
    "description": "Norris grabs third in Bahrain and snatches the lead in the 2025 Drivers’ Championship.",
    "detailed_news": "Lando Norris battled through a five-second penalty for a false start to finish third in the Bahrain Grand Prix, helping McLaren to a double podium finish. The result vaulted him into the lead of the Drivers' Championship, edging ahead of Verstappen and teammate Piastri. Norris praised the team’s strategy and emphasized how much he’s matured since last season.",
    "video_link": "",
    "date_of_upload": "2025-04-16T16:00:00-07:00",
    "channel": "McLaren F1 Team"
  },
  {
    "id": 8,
    "title": "George Russell Overcomes Car Issues to Finish P2 in Bahrain",
    "img": "https://media.formula1.com/image/upload/f_auto,c_limit,w_1440,q_auto/t_16by9North/f_auto/q_auto/trackside-images/2025/F1_Grand_Prix_of_Bahrain/2210088308",
    "description": "Russell fights through mechanical gremlins to earn Mercedes a strong podium finish in Bahrain.",
    "detailed_news": "Despite grappling with DRS malfunctions and brake-by-wire issues, George Russell secured an impressive second-place finish at the Bahrain Grand Prix. His consistency and racecraft proved crucial for Mercedes, who appear to have taken a step forward in 2025 after a difficult previous season. Russell called the drive 'one of the toughest' of his career, praising the team’s resilience and setup work.",
    "video_link": "",
    "date_of_upload": "2025-04-16T15:00:00-07:00",
    "channel": "Mercedes-AMG PETRONAS F1 Team"
  },
  {
    "id": 9,
    "title": "Oscar Piastri Takes First Bahrain Win in Dominant McLaren Outing",
    "img": "https://acko-cms.ackoassets.com/Oscar_Piastri_3279194555.jpg",
    "description": "Oscar Piastri delivers a flawless drive to win the 2025 Bahrain GP, marking a significant step forward for McLaren.",
    "detailed_news": "McLaren's Oscar Piastri stormed to victory at the Bahrain Grand Prix, showcasing the team's vastly improved pace for the 2025 season. Starting from pole, Piastri controlled the race from the outset, holding off George Russell and teammate Lando Norris to take his second career win and McLaren’s first at Sakhir. This win puts McLaren firmly in title contention and signals a major shift in the 2025 pecking order.",
    "video_link": "",
    "date_of_upload": "2025-04-25T14:30:00-07:00",
    "channel": "Formula 1"
  },
  {
    "id": "10",
    "title": "Madrid begins construction of F1 venue as Carlos Sainz becomes circuit ambassador",
    "date_of_upload": "2025-04-27T06:51:38.904Z",
    "description": "Construction of Madrid's Madring circuit has begun, with organisers in the Spanish capital laying the foundation stone for the venue that will host the Spanish Grand Prix as part of a long-term deal announced last year.",
    "detailed_news": "Madrid will become the only European capital city to host a Formula 1 Grand Prix, with a project that has received strong backing from both the Community of Madrid and the City Council since its inception.\n\nSet to be constructed around the IFEMA MADRID exhibition centre fairgrounds and the expansion north east of the city, the 5.4km layout will feature 22 corners – two more than originally proposed – including La Monumental at Turn 12, a 24% banked bend that stretches 550 metres, which Sainz highlighted as the potential icon of the circuit.",
    "img": "https://media.formula1.com/image/upload/f_auto,c_limit,w_960,q_auto/f_auto/q_auto/fom-website/2025/Miscellaneous/GettyImages-2211920143",
    "channel": "F1 Official"
  }
]